<?php
// Подключение к базе данных и другие настройки

$query = $_GET['query'];

// Выполнение поиска в базе данных

// Вывод результатов
?>
<!DOCTYPE html>
<html>
<head>
    <title>Результаты поиска</title>
</head>
<body>
    <link rel="stylesheet" href="styles1.css">
    <h1>Результаты поиска</h1>
    <!-- Вывод результатов поиска -->
    <img src="eda1.jpeg">
    <h2>ПИЦЦА ПЕППЕРОНИ В ДОМАШНИХ УСЛОВИЯХ КЛАССИЧЕСКАЯ</h2>
    <h3>ИНГРЕДИЕНТЫ</h3>
    <h3>мука 250гр, вода 120мл, сухие дрожжи 10гр, раст.масло 1 стол.л, сахар 1гр, соль
    1гр,</h3><h3> Помидоры 1шт, Оливковое масло 1стол.л, кетчуп 1стол.л, Томатная паста 1чайн.л.</h3>
        <h4>ПРИГОТОВЛЕНИК</h4>
        <h4>1 Как сделать пиццу Пепперони в домашних условиях? Для начала подготовьте ингредиенты для теста</h4>
        <h4>2 В теплой воде, нагретой до 37-40°С растворите сахар. А затем всыпьте дрожжи и оставьте на 15 минут до появления пышной шапочки. Если шапочки так и не появилось, то либо дрожжи испорчены, либо перегрели воду и тесто не поднимется. Нужно замешивать заново.</h4>
        <h4>3 В миску просейте муку. Всыпьте соль. Перемешайте все и сделайте в центре муки углубление.</h4>
        <h4>4 Влейте в него активированные дрожжи и оливковое масло</h4>
        <h4>5 Замесите упругое однородное тесто. Замешивать нужно около 7-10 минут, пока тесто не начнет отлипать от рук. Накройте миску полотенцем и оставьте тесто на 45 минут в тепле для подъема</h4>
        <h4>6 Пока поднимается тесто, приготовьте соус. Кетчуп лучше берите шашалычный или другой, с легкой остринкой. Если у вас нет готовой смеси прованских трав, можете собрать такую сами из сушеного тимьяна, розмарина и базилика. Помидоры берите среднего размера, спелые, сочные и ароматные.</h4>
        <h4>7 Помидоры вымойте, сделайте надрезы крест-накрест. Залейте кипятком и оставьте на 1 минуту. Затем снимите с них кожицу.</h4>
        <h4>8 В чаше блендера соедините помидоры, кетчуп, дольки чеснока, прованские травы и специи. Взбейте все до однородности.</h4>
        <h4>9 В сковороде на среднем огне разогрейте растительное масло. Вылейте взбитую томатную смесь, добавьте томатную пасту. Перемешайте и тушите, помешивая, около 5 минут до испарения жидкости и густоты.</h4>
        <h4>10 Готовый соус снимите с огня и охладите.</h4>
        <h4>11 Теперь приготовьте начинку. Пицца получила свое название благодаря одноименной колбасе, в которую добавляют острый перец чили. Поэтому использовать для пиццы лучше ее. На замену подойдет чоризо.</h4>
        <h4>12 Тесто обомните и раскатайте в тонкую круглую лепешку диаметром около 30 см.</h4>
        <h4>13 Перенесите лепешку на застеленный пергаментом противень. Это нужно делать сразу, до того, как выложите начинку, потом это сделать будет сложнее, а под тяжестью начинки тесто может растянуться и потерять форму. Я раскатываю сначала на столе, потом сразу переношу на пергамент, а пергамент с основой - на противень.</h4>
        <h4>14 Обильно смажьте тесто пряным томатным соусом.</h4>
        <h4>15 Сверху посыпьте тертым сыром.</h4>
        <h4>17 Поверх равномерно распределите кружочки пепперони. Выпекайте пиццу в разогретой до 250°С духовке 8-10 минут. Точное время зависит от вашей духовки. Если есть возможность включить режим "верх+низ+конвекция", используйте его. Приятного аппетита!</h4>

</body>
</html>